DISTORTEC/distortos/source/chip/STM32/peripherals/SPIv1/include/distortos/chip/STM32-SPIv1-bits.h
/**
 * \file
 * \brief Header with definition of bits in STM32 SPIv1 control registers
 *
 * \author Copyright (C) 2016 Kamil Szczygiel http://www.distortec.com http://www.freddiechopin.info
 *
 * \par License
 * This Source Code Form is subject to the terms of the Mozilla Public License, v. 2.0. If a copy of the MPL was not
 * distributed with this file, You can obtain one at http://mozilla.org/MPL/2.0/.
 */

#ifndef SOURCE_CHIP_STM32_PERIPHERALS_SPIV1_INCLUDE_DISTORTOS_CHIP_STM32_SPIV1_BITS_H_
#define SOURCE_CHIP_STM32_PERIPHERALS_SPIV1_INCLUDE_DISTORTOS_CHIP_STM32_SPIV1_BITS_H_

#include "distortos/architecture/ARMv7-M-bit-banding.h"

/*---------------------------------------------------------------------------------------------------------------------+
| SPI_CR1 - SPI control register 1
+---------------------------------------------------------------------------------------------------------------------*/

#define SPI_CR1_BIDIMODE_bit				15
#define SPI_CR1_BIDIOE_bit					14
#define SPI_CR1_CRCEN_bit					13
#define SPI_CR1_CRCNEXT_bit					12
#define SPI_CR1_DFF_bit						11
#define SPI_CR1_RXONLY_bit					10
#define SPI_CR1_SSM_bit						9
#define SPI_CR1_SSI_bit						8
#define SPI_CR1_LSBFIRST_bit				7
#define SPI_CR1_SPE_bit						6
#define SPI_CR1_BR_bit						3
#define SPI_CR1_BR_0_bit					3
#define SPI_CR1_BR_1_bit					4
#define SPI_CR1_BR_2_bit					5
#define SPI_CR1_MSTR_bit					2
#define SPI_CR1_CPOL_bit					1
#define SPI_CR1_CPHA_bit					0

#define SPI_CR1_BR_DIV2_value				0
#define SPI_CR1_BR_DIV4_value				1
#define SPI_CR1_BR_DIV8_value				2
#define SPI_CR1_BR_DIV16_value				3
#define SPI_CR1_BR_DIV32_value				4
#define SPI_CR1_BR_DIV64_value				5
#define SPI_CR1_BR_DIV128_value				6
#define SPI_CR1_BR_DIV256_value				7
#define SPI_CR1_BR_mask						7

#define SPI_CR1_BR_DIV2						(SPI_CR1_BR_DIV2_value << SPI_CR1_BR_bit)
#define SPI_CR1_BR_DIV4						(SPI_CR1_BR_DIV4_value << SPI_CR1_BR_bit)
#define SPI_CR1_BR_DIV8						(SPI_CR1_BR_DIV8_value << SPI_CR1_BR_bit)
#define SPI_CR1_BR_DIV16					(SPI_CR1_BR_DIV16_value << SPI_CR1_BR_bit)
#define SPI_CR1_BR_DIV32					(SPI_CR1_BR_DIV32_value << SPI_CR1_BR_bit)
#define SPI_CR1_BR_DIV64					(SPI_CR1_BR_DIV64_value << SPI_CR1_BR_bit)
#define SPI_CR1_BR_DIV128					(SPI_CR1_BR_DIV128_value << SPI_CR1_BR_bit)
#define SPI_CR1_BR_DIV256					(SPI_CR1_BR_DIV256_value << SPI_CR1_BR_bit)

#define SPIx_CR1_BIDIMODE_bb(base)			BITBAND(&(base)->CR1, SPI_CR1_BIDIMODE_bit)
#define SPIx_CR1_BIDIOE_bb(base)			BITBAND(&(base)->CR1, SPI_CR1_BIDIOE_bit)
#define SPIx_CR1_CRCEN_bb(base)				BITBAND(&(base)->CR1, SPI_CR1_CRCEN_bit)
#define SPIx_CR1_CRCNEXT_bb(base)			BITBAND(&(base)->CR1, SPI_CR1_CRCNEXT_bit)
#define SPIx_CR1_DFF_bb(base)				BITBAND(&(base)->CR1, SPI_CR1_DFF_bit)
#define SPIx_CR1_RXONLY_bb(base)			BITBAND(&(base)->CR1, SPI_CR1_RXONLY_bit)
#define SPIx_CR1_SSM_bb(base)				BITBAND(&(base)->CR1, SPI_CR1_SSM_bit)
#define SPIx_CR1_SSI_bb(base)				BITBAND(&(base)->CR1, SPI_CR1_SSI_bit)
#define SPIx_CR1_LSBFIRST_bb(base)			BITBAND(&(base)->CR1, SPI_CR1_LSBFIRST_bit)
#define SPIx_CR1_SPE_bb(base)				BITBAND(&(base)->CR1, SPI_CR1_SPE_bit)
#define SPIx_CR1_BR_0_bb(base)				BITBAND(&(base)->CR1, SPI_CR1_BR_0_bit)
#define SPIx_CR1_BR_1_bb(base)				BITBAND(&(base)->CR1, SPI_CR1_BR_1_bit)
#define SPIx_CR1_BR_2_bb(base)				BITBAND(&(base)->CR1, SPI_CR1_BR_2_bit)
#define SPIx_CR1_MSTR_bb(base)				BITBAND(&(base)->CR1, SPI_CR1_MSTR_bit)
#define SPIx_CR1_CPOL_bb(base)				BITBAND(&(base)->CR1, SPI_CR1_CPOL_bit)
#define SPIx_CR1_CPHA_bb(base)				BITBAND(&(base)->CR1, SPI_CR1_CPHA_bit)

#define SPI1_CR1_BIDIMODE_bb				SPIx_CR1_BIDIMODE_bb(SPI1)
#define SPI1_CR1_BIDIOE_bb					SPIx_CR1_BIDIOE_bb(SPI1)
#define SPI1_CR1_CRCEN_bb					SPIx_CR1_CRCEN_bb(SPI1)
#define SPI1_CR1_CRCNEXT_bb					SPIx_CR1_CRCNEXT_bb(SPI1)
#define SPI1_CR1_DFF_bb						SPIx_CR1_DFF_bb(SPI1)
#define SPI1_CR1_RXONLY_bb					SPIx_CR1_RXONLY_bb(SPI1)
#define SPI1_CR1_SSM_bb						SPIx_CR1_SSM_bb(SPI1)
#define SPI1_CR1_SSI_bb						SPIx_CR1_SSI_bb(SPI1)
#define SPI1_CR1_LSBFIRST_bb				SPIx_CR1_LSBFIRST_bb(SPI1)
#define SPI1_CR1_SPE_bb						SPIx_CR1_SPE_bb(SPI1)
#define SPI1_CR1_BR_0_bb					SPIx_CR1_BR_0_bb(SPI1)
#define SPI1_CR1_BR_1_bb					SPIx_CR1_BR_1_bb(SPI1)
#define SPI1_CR1_BR_2_bb					SPIx_CR1_BR_2_bb(SPI1)
#define SPI1_CR1_MSTR_bb					SPIx_CR1_MSTR_bb(SPI1)
#define SPI1_CR1_CPOL_bb					SPIx_CR1_CPOL_bb(SPI1)
#define SPI1_CR1_CPHA_bb					SPIx_CR1_CPHA_bb(SPI1)

#define SPI2_CR1_BIDIMODE_bb				SPIx_CR1_BIDIMODE_bb(SPI2)
#define SPI2_CR1_BIDIOE_bb					SPIx_CR1_BIDIOE_bb(SPI2)
#define SPI2_CR1_CRCEN_bb					SPIx_CR1_CRCEN_bb(SPI2)
#define SPI2_CR1_CRCNEXT_bb					SPIx_CR1_CRCNEXT_bb(SPI2)
#define SPI2_CR1_DFF_bb						SPIx_CR1_DFF_bb(SPI2)
#define SPI2_CR1_RXONLY_bb					SPIx_CR1_RXONLY_bb(SPI2)
#define SPI2_CR1_SSM_bb						SPIx_CR1_SSM_bb(SPI2)
#define SPI2_CR1_SSI_bb						SPIx_CR1_SSI_bb(SPI2)
#define SPI2_CR1_LSBFIRST_bb				SPIx_CR1_LSBFIRST_bb(SPI2)
#define SPI2_CR1_SPE_bb						SPIx_CR1_SPE_bb(SPI2)
#define SPI2_CR1_BR_0_bb					SPIx_CR1_BR_0_bb(SPI2)
#define SPI2_CR1_BR_1_bb					SPIx_CR1_BR_1_bb(SPI2)
#define SPI2_CR1_BR_2_bb					SPIx_CR1_BR_2_bb(SPI2)
#define SPI2_CR1_MSTR_bb					SPIx_CR1_MSTR_bb(SPI2)
#define SPI2_CR1_CPOL_bb					SPIx_CR1_CPOL_bb(SPI2)
#define SPI2_CR1_CPHA_bb					SPIx_CR1_CPHA_bb(SPI2)

#define SPI3_CR1_BIDIMODE_bb				SPIx_CR1_BIDIMODE_bb(SPI3)
#define SPI3_CR1_BIDIOE_bb					SPIx_CR1_BIDIOE_bb(SPI3)
#define SPI3_CR1_CRCEN_bb					SPIx_CR1_CRCEN_bb(SPI3)
#define SPI3_CR1_CRCNEXT_bb					SPIx_CR1_CRCNEXT_bb(SPI3)
#define SPI3_CR1_DFF_bb						SPIx_CR1_DFF_bb(SPI3)
#define SPI3_CR1_RXONLY_bb					SPIx_CR1_RXONLY_bb(SPI3)
#define SPI3_CR1_SSM_bb						SPIx_CR1_SSM_bb(SPI3)
#define SPI3_CR1_SSI_bb						SPIx_CR1_SSI_bb(SPI3)
#define SPI3_CR1_LSBFIRST_bb				SPIx_CR1_LSBFIRST_bb(SPI3)
#define SPI3_CR1_SPE_bb						SPIx_CR1_SPE_bb(SPI3)
#define SPI3_CR1_BR_0_bb					SPIx_CR1_BR_0_bb(SPI3)
#define SPI3_CR1_BR_1_bb					SPIx_CR1_BR_1_bb(SPI3)
#define SPI3_CR1_BR_2_bb					SPIx_CR1_BR_2_bb(SPI3)
#define SPI3_CR1_MSTR_bb					SPIx_CR1_MSTR_bb(SPI3)
#define SPI3_CR1_CPOL_bb					SPIx_CR1_CPOL_bb(SPI3)
#define SPI3_CR1_CPHA_bb					SPIx_CR1_CPHA_bb(SPI3)

#define SPI4_CR1_BIDIMODE_bb				SPIx_CR1_BIDIMODE_bb(SPI4)
#define SPI4_CR1_BIDIOE_bb					SPIx_CR1_BIDIOE_bb(SPI4)
#define SPI4_CR1_CRCEN_bb					SPIx_CR1_CRCEN_bb(SPI4)
#define SPI4_CR1_CRCNEXT_bb					SPIx_CR1_CRCNEXT_bb(SPI4)
#define SPI4_CR1_DFF_bb						SPIx_CR1_DFF_bb(SPI4)
#define SPI4_CR1_RXONLY_bb					SPIx_CR1_RXONLY_bb(SPI4)
#define SPI4_CR1_SSM_bb						SPIx_CR1_SSM_bb(SPI4)
#define SPI4_CR1_SSI_bb						SPIx_CR1_SSI_bb(SPI4)
#define SPI4_CR1_LSBFIRST_bb				SPIx_CR1_LSBFIRST_bb(SPI4)
#define SPI4_CR1_SPE_bb						SPIx_CR1_SPE_bb(SPI4)
#define SPI4_CR1_BR_0_bb					SPIx_CR1_BR_0_bb(SPI4)
#define SPI4_CR1_BR_1_bb					SPIx_CR1_BR_1_bb(SPI4)
#define SPI4_CR1_BR_2_bb					SPIx_CR1_BR_2_bb(SPI4)
#define SPI4_CR1_MSTR_bb					SPIx_CR1_MSTR_bb(SPI4)
#define SPI4_CR1_CPOL_bb					SPIx_CR1_CPOL_bb(SPI4)
#define SPI4_CR1_CPHA_bb					SPIx_CR1_CPHA_bb(SPI4)

#define SPI5_CR1_BIDIMODE_bb				SPIx_CR1_BIDIMODE_bb(SPI5)
#define SPI5_CR1_BIDIOE_bb					SPIx_CR1_BIDIOE_bb(SPI5)
#define SPI5_CR1_CRCEN_bb					SPIx_CR1_CRCEN_bb(SPI5)
#define SPI5_CR1_CRCNEXT_bb					SPIx_CR1_CRCNEXT_bb(SPI5)
#define SPI5_CR1_DFF_bb						SPIx_CR1_DFF_bb(SPI5)
#define SPI5_CR1_RXONLY_bb					SPIx_CR1_RXONLY_bb(SPI5)
#define SPI5_CR1_SSM_bb						SPIx_CR1_SSM_bb(SPI5)
#define SPI5_CR1_SSI_bb						SPIx_CR1_SSI_bb(SPI5)
#define SPI5_CR1_LSBFIRST_bb				SPIx_CR1_LSBFIRST_bb(SPI5)
#define SPI5_CR1_SPE_bb						SPIx_CR1_SPE_bb(SPI5)
#define SPI5_CR1_BR_0_bb					SPIx_CR1_BR_0_bb(SPI5)
#define SPI5_CR1_BR_1_bb					SPIx_CR1_BR_1_bb(SPI5)
#define SPI5_CR1_BR_2_bb					SPIx_CR1_BR_2_bb(SPI5)
#define SPI5_CR1_MSTR_bb					SPIx_CR1_MSTR_bb(SPI5)
#define SPI5_CR1_CPOL_bb					SPIx_CR1_CPOL_bb(SPI5)
#define SPI5_CR1_CPHA_bb					SPIx_CR1_CPHA_bb(SPI5)

#define SPI6_CR1_BIDIMODE_bb				SPIx_CR1_BIDIMODE_bb(SPI6)
#define SPI6_CR1_BIDIOE_bb					SPIx_CR1_BIDIOE_bb(SPI6)
#define SPI6_CR1_CRCEN_bb					SPIx_CR1_CRCEN_bb(SPI6)
#define SPI6_CR1_CRCNEXT_bb					SPIx_CR1_CRCNEXT_bb(SPI6)
#define SPI6_CR1_DFF_bb						SPIx_CR1_DFF_bb(SPI6)
#define SPI6_CR1_RXONLY_bb					SPIx_CR1_RXONLY_bb(SPI6)
#define SPI6_CR1_SSM_bb						SPIx_CR1_SSM_bb(SPI6)
#define SPI6_CR1_SSI_bb						SPIx_CR1_SSI_bb(SPI6)
#define SPI6_CR1_LSBFIRST_bb				SPIx_CR1_LSBFIRST_bb(SPI6)
#define SPI6_CR1_SPE_bb						SPIx_CR1_SPE_bb(SPI6)
#define SPI6_CR1_BR_0_bb					SPIx_CR1_BR_0_bb(SPI6)
#define SPI6_CR1_BR_1_bb					SPIx_CR1_BR_1_bb(SPI6)
#define SPI6_CR1_BR_2_bb					SPIx_CR1_BR_2_bb(SPI6)
#define SPI6_CR1_MSTR_bb					SPIx_CR1_MSTR_bb(SPI6)
#define SPI6_CR1_CPOL_bb					SPIx_CR1_CPOL_bb(SPI6)
#define SPI6_CR1_CPHA_bb					SPIx_CR1_CPHA_bb(SPI6)

