DISTORTEC/distortos/source/chip/STM32/peripherals/SPIv1/include/distortos/chip/STM32-SPIv1-bits.h
/*---------------------------------------------------------------------------------------------------------------------+
| SPI_I2SCFGR - SPI_I2S configuration register
+---------------------------------------------------------------------------------------------------------------------*/

#define SPI_I2SCFGR_ASTREN_bit				12
#define SPI_I2SCFGR_I2SMOD_bit				11
#define SPI_I2SCFGR_I2SE_bit				10
#define SPI_I2SCFGR_I2SCFG_bit				8
#define SPI_I2SCFGR_I2SCFG_0_bit			8
#define SPI_I2SCFGR_I2SCFG_1_bit			9
#define SPI_I2SCFGR_PCMSYNC_bit				7
#define SPI_I2SCFGR_I2SSTD_bit				4
#define SPI_I2SCFGR_I2SSTD_0_bit			4
#define SPI_I2SCFGR_I2SSTD_1_bit			5
#define SPI_I2SCFGR_CKPOL_bit				3
#define SPI_I2SCFGR_DATLEN_bit				1
#define SPI_I2SCFGR_DATLEN_0_bit			1
#define SPI_I2SCFGR_DATLEN_1_bit			2
#define SPI_I2SCFGR_CHLEN_bit				0

#define SPI_I2SCFGR_I2SCFG_SLV_TX_value		0
#define SPI_I2SCFGR_I2SCFG_SLV_RX_value		1
#define SPI_I2SCFGR_I2SCFG_MSTR_TX_value	2
#define SPI_I2SCFGR_I2SCFG_MSTR_RX_value	3
#define SPI_I2SCFGR_I2SCFG_mask				3

#define SPI_I2SCFGR_I2SSTD_I2S_value		0
#define SPI_I2SCFGR_I2SSTD_MSB_value		1
#define SPI_I2SCFGR_I2SSTD_LSB_value		2
#define SPI_I2SCFGR_I2SSTD_PCM_value		3
#define SPI_I2SCFGR_I2SSTD_mask				3

#define SPI_I2SCFGR_DATLEN_16BIT_value		0
#define SPI_I2SCFGR_DATLEN_24BIT_value		1
#define SPI_I2SCFGR_DATLEN_32BIT_value		2
#define SPI_I2SCFGR_DATLEN_mask				3

#define SPI_I2SCFGR_I2SCFG_SLV_TX			(SPI_I2SCFGR_I2SCFG_SLV_TX_value << SPI_I2SCFGR_I2SCFG_bit)
#define SPI_I2SCFGR_I2SCFG_SLV_RX			(SPI_I2SCFGR_I2SCFG_SLV_RX_value << SPI_I2SCFGR_I2SCFG_bit)
#define SPI_I2SCFGR_I2SCFG_MSTR_TX			(SPI_I2SCFGR_I2SCFG_MSTR_TX_value << SPI_I2SCFGR_I2SCFG_bit)
#define SPI_I2SCFGR_I2SCFG_MSTR_RX			(SPI_I2SCFGR_I2SCFG_MSTR_RX_value << SPI_I2SCFGR_I2SCFG_bit)

#define SPI_I2SCFGR_I2SSTD_I2S				(SPI_I2SCFGR_I2SSTD_I2S_value << SPI_I2SCFGR_I2SSTD_bit)
#define SPI_I2SCFGR_I2SSTD_MSB				(SPI_I2SCFGR_I2SSTD_MSB_value << SPI_I2SCFGR_I2SSTD_bit)
#define SPI_I2SCFGR_I2SSTD_LSB				(SPI_I2SCFGR_I2SSTD_LSB_value << SPI_I2SCFGR_I2SSTD_bit)
#define SPI_I2SCFGR_I2SSTD_PCM				(SPI_I2SCFGR_I2SSTD_PCM_value << SPI_I2SCFGR_I2SSTD_bit)

#define SPI_I2SCFGR_DATLEN_16BIT			(SPI_I2SCFGR_DATLEN_16BIT_value << SPI_I2SCFGR_DATLEN_bit)
#define SPI_I2SCFGR_DATLEN_24BIT			(SPI_I2SCFGR_DATLEN_24BIT_value << SPI_I2SCFGR_DATLEN_bit)
#define SPI_I2SCFGR_DATLEN_32BIT			(SPI_I2SCFGR_DATLEN_32BIT_value << SPI_I2SCFGR_DATLEN_bit)

#define SPIx_I2SCFGR_ASTREN_bb(base)		BITBAND(&(base)->I2SCFGR, SPI_I2SCFGR_ASTREN_bit)
#define SPIx_I2SCFGR_I2SMOD_bb(base)		BITBAND(&(base)->I2SCFGR, SPI_I2SCFGR_I2SMOD_bit)
#define SPIx_I2SCFGR_I2SE_bb(base)			BITBAND(&(base)->I2SCFGR, SPI_I2SCFGR_I2SE_bit)
#define SPIx_I2SCFGR_I2SCFG_0_bb(base)		BITBAND(&(base)->I2SCFGR, SPI_I2SCFGR_I2SCFG_0_bit)
#define SPIx_I2SCFGR_I2SCFG_1_bb(base)		BITBAND(&(base)->I2SCFGR, SPI_I2SCFGR_I2SCFG_1_bit)
#define SPIx_I2SCFGR_PCMSYNC_bb(base)		BITBAND(&(base)->I2SCFGR, SPI_I2SCFGR_PCMSYNC_bit)
#define SPIx_I2SCFGR_I2SSTD_0_bb(base)		BITBAND(&(base)->I2SCFGR, SPI_I2SCFGR_I2SSTD_0_bit)
#define SPIx_I2SCFGR_I2SSTD_1_bb(base)		BITBAND(&(base)->I2SCFGR, SPI_I2SCFGR_I2SSTD_1_bit)
#define SPIx_I2SCFGR_CKPOL_bb(base)			BITBAND(&(base)->I2SCFGR, SPI_I2SCFGR_CKPOL_bit)
#define SPIx_I2SCFGR_DATLEN_0_bb(base)		BITBAND(&(base)->I2SCFGR, SPI_I2SCFGR_DATLEN_0_bit)
#define SPIx_I2SCFGR_DATLEN_1_bb(base)		BITBAND(&(base)->I2SCFGR, SPI_I2SCFGR_DATLEN_1_bit)
#define SPIx_I2SCFGR_CHLEN_bb(base)			BITBAND(&(base)->I2SCFGR, SPI_I2SCFGR_CHLEN_bit)

#define SPI1_I2SCFGR_ASTREN_bb				SPIx_I2SCFGR_ASTREN_bb(SPI1)
#define SPI1_I2SCFGR_I2SMOD_bb				SPIx_I2SCFGR_I2SMOD_bb(SPI1)
#define SPI1_I2SCFGR_I2SE_bb				SPIx_I2SCFGR_I2SE_bb(SPI1)
#define SPI1_I2SCFGR_I2SCFG_0_bb			SPIx_I2SCFGR_I2SCFG_0_bb(SPI1)
#define SPI1_I2SCFGR_I2SCFG_1_bb			SPIx_I2SCFGR_I2SCFG_1_bb(SPI1)
#define SPI1_I2SCFGR_PCMSYNC_bb				SPIx_I2SCFGR_PCMSYNC_bb(SPI1)
#define SPI1_I2SCFGR_I2SSTD_0_bb			SPIx_I2SCFGR_I2SSTD_0_bb(SPI1)
#define SPI1_I2SCFGR_I2SSTD_1_bb			SPIx_I2SCFGR_I2SSTD_1_bb(SPI1)
#define SPI1_I2SCFGR_CKPOL_bb				SPIx_I2SCFGR_CKPOL_bb(SPI1)
#define SPI1_I2SCFGR_DATLEN_0_bb			SPIx_I2SCFGR_DATLEN_0_bb(SPI1)
#define SPI1_I2SCFGR_DATLEN_1_bb			SPIx_I2SCFGR_DATLEN_1_bb(SPI1)
#define SPI1_I2SCFGR_CHLEN_bb				SPIx_I2SCFGR_CHLEN_bb(SPI1)

#define SPI2_I2SCFGR_ASTREN_bb				SPIx_I2SCFGR_ASTREN_bb(SPI2)
#define SPI2_I2SCFGR_I2SMOD_bb				SPIx_I2SCFGR_I2SMOD_bb(SPI2)
#define SPI2_I2SCFGR_I2SE_bb				SPIx_I2SCFGR_I2SE_bb(SPI2)
#define SPI2_I2SCFGR_I2SCFG_0_bb			SPIx_I2SCFGR_I2SCFG_0_bb(SPI2)
#define SPI2_I2SCFGR_I2SCFG_1_bb			SPIx_I2SCFGR_I2SCFG_1_bb(SPI2)
#define SPI2_I2SCFGR_PCMSYNC_bb				SPIx_I2SCFGR_PCMSYNC_bb(SPI2)
#define SPI2_I2SCFGR_I2SSTD_0_bb			SPIx_I2SCFGR_I2SSTD_0_bb(SPI2)
#define SPI2_I2SCFGR_I2SSTD_1_bb			SPIx_I2SCFGR_I2SSTD_1_bb(SPI2)
#define SPI2_I2SCFGR_CKPOL_bb				SPIx_I2SCFGR_CKPOL_bb(SPI2)
#define SPI2_I2SCFGR_DATLEN_0_bb			SPIx_I2SCFGR_DATLEN_0_bb(SPI2)
#define SPI2_I2SCFGR_DATLEN_1_bb			SPIx_I2SCFGR_DATLEN_1_bb(SPI2)
#define SPI2_I2SCFGR_CHLEN_bb				SPIx_I2SCFGR_CHLEN_bb(SPI2)

#define SPI3_I2SCFGR_ASTREN_bb				SPIx_I2SCFGR_ASTREN_bb(SPI3)
#define SPI3_I2SCFGR_I2SMOD_bb				SPIx_I2SCFGR_I2SMOD_bb(SPI3)
#define SPI3_I2SCFGR_I2SE_bb				SPIx_I2SCFGR_I2SE_bb(SPI3)
#define SPI3_I2SCFGR_I2SCFG_0_bb			SPIx_I2SCFGR_I2SCFG_0_bb(SPI3)
#define SPI3_I2SCFGR_I2SCFG_1_bb			SPIx_I2SCFGR_I2SCFG_1_bb(SPI3)
#define SPI3_I2SCFGR_PCMSYNC_bb				SPIx_I2SCFGR_PCMSYNC_bb(SPI3)
#define SPI3_I2SCFGR_I2SSTD_0_bb			SPIx_I2SCFGR_I2SSTD_0_bb(SPI3)
#define SPI3_I2SCFGR_I2SSTD_1_bb			SPIx_I2SCFGR_I2SSTD_1_bb(SPI3)
#define SPI3_I2SCFGR_CKPOL_bb				SPIx_I2SCFGR_CKPOL_bb(SPI3)
#define SPI3_I2SCFGR_DATLEN_0_bb			SPIx_I2SCFGR_DATLEN_0_bb(SPI3)
#define SPI3_I2SCFGR_DATLEN_1_bb			SPIx_I2SCFGR_DATLEN_1_bb(SPI3)
#define SPI3_I2SCFGR_CHLEN_bb				SPIx_I2SCFGR_CHLEN_bb(SPI3)

#define SPI4_I2SCFGR_ASTREN_bb				SPIx_I2SCFGR_ASTREN_bb(SPI4)
#define SPI4_I2SCFGR_I2SMOD_bb				SPIx_I2SCFGR_I2SMOD_bb(SPI4)
#define SPI4_I2SCFGR_I2SE_bb				SPIx_I2SCFGR_I2SE_bb(SPI4)
#define SPI4_I2SCFGR_I2SCFG_0_bb			SPIx_I2SCFGR_I2SCFG_0_bb(SPI4)
#define SPI4_I2SCFGR_I2SCFG_1_bb			SPIx_I2SCFGR_I2SCFG_1_bb(SPI4)
#define SPI4_I2SCFGR_PCMSYNC_bb				SPIx_I2SCFGR_PCMSYNC_bb(SPI4)
#define SPI4_I2SCFGR_I2SSTD_0_bb			SPIx_I2SCFGR_I2SSTD_0_bb(SPI4)
#define SPI4_I2SCFGR_I2SSTD_1_bb			SPIx_I2SCFGR_I2SSTD_1_bb(SPI4)
#define SPI4_I2SCFGR_CKPOL_bb				SPIx_I2SCFGR_CKPOL_bb(SPI4)
#define SPI4_I2SCFGR_DATLEN_0_bb			SPIx_I2SCFGR_DATLEN_0_bb(SPI4)
#define SPI4_I2SCFGR_DATLEN_1_bb			SPIx_I2SCFGR_DATLEN_1_bb(SPI4)
#define SPI4_I2SCFGR_CHLEN_bb				SPIx_I2SCFGR_CHLEN_bb(SPI4)

#define SPI5_I2SCFGR_ASTREN_bb				SPIx_I2SCFGR_ASTREN_bb(SPI5)
#define SPI5_I2SCFGR_I2SMOD_bb				SPIx_I2SCFGR_I2SMOD_bb(SPI5)
#define SPI5_I2SCFGR_I2SE_bb				SPIx_I2SCFGR_I2SE_bb(SPI5)
#define SPI5_I2SCFGR_I2SCFG_0_bb			SPIx_I2SCFGR_I2SCFG_0_bb(SPI5)
#define SPI5_I2SCFGR_I2SCFG_1_bb			SPIx_I2SCFGR_I2SCFG_1_bb(SPI5)
#define SPI5_I2SCFGR_PCMSYNC_bb				SPIx_I2SCFGR_PCMSYNC_bb(SPI5)
#define SPI5_I2SCFGR_I2SSTD_0_bb			SPIx_I2SCFGR_I2SSTD_0_bb(SPI5)
#define SPI5_I2SCFGR_I2SSTD_1_bb			SPIx_I2SCFGR_I2SSTD_1_bb(SPI5)
#define SPI5_I2SCFGR_CKPOL_bb				SPIx_I2SCFGR_CKPOL_bb(SPI5)
#define SPI5_I2SCFGR_DATLEN_0_bb			SPIx_I2SCFGR_DATLEN_0_bb(SPI5)
#define SPI5_I2SCFGR_DATLEN_1_bb			SPIx_I2SCFGR_DATLEN_1_bb(SPI5)
#define SPI5_I2SCFGR_CHLEN_bb				SPIx_I2SCFGR_CHLEN_bb(SPI5)

#define SPI6_I2SCFGR_ASTREN_bb				SPIx_I2SCFGR_ASTREN_bb(SPI6)
#define SPI6_I2SCFGR_I2SMOD_bb				SPIx_I2SCFGR_I2SMOD_bb(SPI6)
#define SPI6_I2SCFGR_I2SE_bb				SPIx_I2SCFGR_I2SE_bb(SPI6)
#define SPI6_I2SCFGR_I2SCFG_0_bb			SPIx_I2SCFGR_I2SCFG_0_bb(SPI6)
#define SPI6_I2SCFGR_I2SCFG_1_bb			SPIx_I2SCFGR_I2SCFG_1_bb(SPI6)
#define SPI6_I2SCFGR_PCMSYNC_bb				SPIx_I2SCFGR_PCMSYNC_bb(SPI6)
#define SPI6_I2SCFGR_I2SSTD_0_bb			SPIx_I2SCFGR_I2SSTD_0_bb(SPI6)
#define SPI6_I2SCFGR_I2SSTD_1_bb			SPIx_I2SCFGR_I2SSTD_1_bb(SPI6)
#define SPI6_I2SCFGR_CKPOL_bb				SPIx_I2SCFGR_CKPOL_bb(SPI6)
#define SPI6_I2SCFGR_DATLEN_0_bb			SPIx_I2SCFGR_DATLEN_0_bb(SPI6)
#define SPI6_I2SCFGR_DATLEN_1_bb			SPIx_I2SCFGR_DATLEN_1_bb(SPI6)
#define SPI6_I2SCFGR_CHLEN_bb				SPIx_I2SCFGR_CHLEN_bb(SPI6)

